# Parameters
nc: 1000 # number of classes
activation: Mish
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.00, 1.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2     #1
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4   #1
  - [-1, 3, C2f, [128, True, 1]]   # 2       #8
  - [-1, 1, CBAM, []]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8   #1
  - [-1, 6, C2f, [256, True]]  # 4        #14
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16  #1
  - [-1, 6, C2f, [256, True]]  # 6        #14
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32 #1
  - [-1, 3, C2f, [1024, True]]  # 8       #8
  - [-1, 1, CBAM, []]


head:
  - [-1, 1, Classify, [nc]] # Classify    #1