# Parameters
nc: 1000 # number of classes
activation: Mish
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.00, 1.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, nn.Identity, []] #0

  - [-1, 1, Conv, [64, 3, 2]]    # 1
  - [-1, 1, Conv, [256, 3, 2]]   # 3

  - [0, 1, Conv, [64, 3, 2]]     # 3
  - [-1, 1, Conv, [256, 3, 2]]   # 6

  - [0, 1, Conv, [64, 3, 2 ]]     # 7
  - [-1, 1, Conv, [256, 3, 2 ]]   # 9

  - [[2, 4, 6], 1, Concat,[]]     # 10
  - [-1, 1, Conv, [512, 3, 2 ]]   # 11

head:
  - [-1, 1, Classify, [nc]] # Classify